

&НаСервереБезКонтекста
Функция ПереченьХарактеристикХарактеристикаТовараПриИзмененииНаСервере(Характеристика)
	Возврат Характеристика.ТипЗначения;
КонецФункции


&НаКлиенте
Процедура ПереченьХарактеристикХарактеристикаТовараПриИзменении(Элемент)
	ТекСтрока = Элементы.ПереченьХарактеристик.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		ТипЗначения = ПереченьХарактеристикХарактеристикаТовараПриИзмененииНаСервере(ТекСтрока.ХарактеристикаТовара);
		ТекСтрока.ЗначениеХарактеристики = Неопределено;
		Элементы.ПереченьХарактеристикЗначениеХарактеристики.ОграничениеТипа = ТипЗначения;
		
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Наименование = "";
	Для Каждого СтрокаТЧ из Объект.ПереченьХарактеристик Цикл
		
		Если ЗначениеЗаполнено(СтрокаТЧ.ХарактеристикаТовара) И ЗначениеЗаполнено(СтрокаТЧ.ЗначениеХарактеристики) Тогда
			Наименование = Наименование 
			+ ?(ПустаяСтрока(Наименование), "", "; ")
			+ СтрокаТЧ.ХарактеристикаТовара + ": " + СтрокаТЧ.ЗначениеХарактеристики;
		КонецЕсли;
		
	КонецЦикла;
	Если ПустаяСтрока(Наименование) Тогда
		Наименование = "Наименование без характеристик";
	КонецЕсли;
	
	Объект.Наименование = Наименование;

КонецПроцедуры