
&НаСервереБезКонтекста
Процедура КурсЗапросомНаСервере(Валюта, ДН)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Валюта,
		|	КурсыВалютСрезПоследних.Курс,
		|	КурсыВалютСрезПоследних.Кратность
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&ДН, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("ДН", ДН);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить("Обработка запросом выполнена");
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецПроцедуры

&НаКлиенте
Процедура КурсЗапросом(Команда)
	КурсЗапросомНаСервере(Валюта ,Объект.ДатаНачала);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КурсОМНаСервере(Валюта, ДатаНачала)
	Отбор = Новый Структура("Валюта", Валюта);
	Запись = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаНачала, Отбор);
КонецПроцедуры

&НаКлиенте
Процедура КурсОМ(Команда)
	КурсОМНаСервере(Валюта ,Объект.ДатаНачала);
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ВыбратьДанныеНаСервере(ДатаНачала, ДК)
	Выборка = РегистрыСведений.КурсыВалют.Выбрать(ДатаНачала, ДК);
	Пока Выборка.Следующий() Цикл
		Сообщить("Чтение данных записи");
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДанные(Команда)
	ВыбратьДанныеНаСервере(Объект.ДатаНачала, Объект.ДатаОкончания);
КонецПроцедуры
