
&НаСервереБезКонтекста
Процедура ПеребратьНаименованияНаСервере()
	// Вставить содержимое обработчика.    
	Выборка  = Справочники.Номенклатура.Выбрать();
	Пока Выборка.Следующий() Цикл
		Сообщить(Выборка.Наименование);
	КонецЦикла	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПеребратьНаименования(Команда)
	ПеребратьНаименованияНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьНовыйЭлкементНаСервере()
	// Вставить содержимое обработчика.
	НовыйОбъект = Справочники.Номенклатура.СоздатьЭлемент();
	НовыйОбъект.Артикул = "0025";
	НовыйОбъект.Наименование = "Дилдо";
	НовыйОбъект.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар;
	НовыйОбъект.ЕдиницаИзмерений = Справочники.ЕдиницыИзмерения.Компл; 
	НовыйОбъект.ЦенаПокупки = 500;
	НовыйОбъект.ЦенаПродажи = 1000;
	НовыйОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйЭлкемент(Команда)
	СоздатьНовыйЭлкементНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПереносНаСервере()
	// Вставить содержимое обработчика.
	НовыйРодитель = Справочники.Номенклатура.НайтиПоКоду("000000008");   
	Выборка = Справочники.Номенклатура.Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			ТекущийОбъект = Выборка.ПолучитьОбъект();
			ТекущийОбъект.Родитель = НовыйРодитель;  
			ТекущийОбъект.Записать();
		Исключение
			Продолжить;
		КонецПопытки
	КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура Перенос(Команда)
	ПереносНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДанныеЗапросаНаСервере()
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.ЕдиницаИзмерений КАК ЕдиницаИзмерений,
		|	Номенклатура.ЦенаПродажи КАК ЦенаПродажи,
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗапроса(Команда)
	ДанныеЗапросаНаСервере();
КонецПроцедуры
