

&НаКлиенте
 Процедура ФамилияПриИзменении(Элемент)
	СформироватьФИО();
 КонецПроцедуры


&НаКлиенте
 Процедура ИмяПриИзменении(Элемент)
	 СформироватьФИО();
 КонецПроцедуры


&НаКлиенте
 Процедура ОтчествоПриИзменении(Элемент)
	 СформироватьФИО();
 КонецПроцедуры  
 

 &НаКлиенте
 Процедура ФормированиеФИО() 
	Объект.Наименование = СокрЛП(Объект.Фамилия) + " " + СокрЛП(Объект.Имя) + " " + СокрЛП(Объект.Отчество);
 КонецПроцедуры
 
 
//Если объект Отчество не заполнен чтобы избежать лишних пробелов  

Процедура СформироватьФИО()
	МассивФИО = Новый Массив();
	Если ЗначениеЗаполнено(Объект.Фамилия) Тогда
		МассивФИО.Добавить(СокрЛП(Объект.Фамилия));	
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Имя) Тогда
		МассивФИО.Добавить(СокрЛП(Объект.Имя));	
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Отчество) Тогда
		МассивФИО.Добавить(СокрЛП(Объект.Отчество));	
	КонецЕсли;
	Объект.Наименование = СтрСоединить(МассивФИО, " ");

КонецПроцедуры




 
