Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ОстаткиНоменклатуры
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаТовары из Товары Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Организация = Организация;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	// регистр ПродажаТоваров
	Движения.ПродажаТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары из Товары Цикл
		Движение = Движения.ПродажаТоваров.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	// регистр ВедомостьПоТоварам
	Движения.ВедомостьПоТоварам.Записывать = Истина;
	Для Каждого ТекСтрокаТовары из Товары Цикл
		Движение = Движения.ВедомостьПоТоварам.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	УчетПоСериям = ПолучитьФункциональнуюОпцию("УчётПоСериям", );
	
	Если НЕ УчетПоСериям Тогда
		Возврат;
	КонецЕсли;
	
	МассивНоменклатуры = ЭтотОбъект.Товары.ВыгрузитьКолонку("Номенклатура");
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка,
	|	Номенклатура.ВидНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ 
	|	Номенклатура.Ссылка в(&МассивНоменклатуры)";
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	ВидНоменклатуры = Запрос.Выполнить().Выгрузить();
	
	Для каждого ТекСтрока из Товары Цикл
		НайденнаяСтрока = ВидНоменклатуры.Найти(ТекСтрока.Номенклатура);
		Если (НайденнаяСтрока.ВидНоменклатуры  =  Перечисления.ВидыНоменклатуры.Товар) И
		  НЕ ЗначениеЗаполнено(ТекСтрока.Серия) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("В строке %1 табличной части 'Товары' не заполнена серия для номенклатуры '%2'.",
                        ТекСтрока.НомерСтроки, ТекСтрока.Номенклатура);
                        	Сообщение.УстановитьДанные(ЭтотОбъект);
                        	Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;	
	КонецЦикла;
	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Товары.Серия"));
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента=Товары.Итог("Сумма") + Товары.Итог("Сумма");
КонецПроцедуры

