
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Значениепараметров = Новый Структура("ПоПодразделениям", Объект.Организация);
	УстановитьПараметрыФункциональныхОпцийФормы(Значениепараметров);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Значениепараметров = Новый Структура("ПоПодразделениям", Объект.Организация);
	УстановитьПараметрыФункциональныхОпцийФормы(Значениепараметров);
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
КонецПроцедуры



&НаСервереБезКонтекста
Процедура УслугиНоменклатураПриИзмененииНаСервере(Номенклатура, Цена, ЕдиницаИзмерения, Поставщик, ДатаНачала)
	Отбор = Новый Структура("Поставщик, Номенклатура", Поставщик, Номенклатура);
	Запись = РегистрыСведений.ЦеныПоставщиков.ПолучитьПоследнее(ДатаНачала, Отбор);
	Цена = Запись.Цена;
	ЕдиницаИзмерения = Номенклатура.ЕдиницаИзмерений; 
КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	ТекСтрока = Элементы.Услуги.ТекущиеДанные;		
	УслугиНоменклатураПриИзмененииНаСервере(ТекСтрока.Номенклатура, ТекСтрока.Цена, ТекСтрока.ЕдиницаИзмерения,
	Объект.Контрагент, Объект.Дата);
	УслугиЦенаПриИзменении(Элемент);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТоварыНоменклатураПриИзмененииНаСервере(Номенклатура, Цена, ЕдиницаИзмерения, Поставщик, ДатаНачала)
	Отбор = Новый Структура("Поставщик, Номенклатура", Поставщик, Номенклатура);
	Запись = РегистрыСведений.ЦеныПоставщиков.ПолучитьПоследнее(ДатаНачала, Отбор);
	Цена = Запись.Цена;
	ЕдиницаИзмерения = Номенклатура.ЕдиницаИзмерений;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;	
	ТоварыНоменклатураПриИзмененииНаСервере(ТекСтрока.Номенклатура, ТекСтрока.Цена, ТекСтрока.ЕдиницаИзмерения, 
	Объект.Контрагент, Объект.Дата);
	ТоварыЦенаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
	ТекСтрока = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
	ТоварыСуммаПриИзменении(Элемент);
КонецПроцедуры


&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
	ТоварыСуммаПриИзменении(Элемент);
КонецПроцедуры

