
&НаСервереБезКонтекста
Процедура УслугиНоменклатураПриИзмененииНаСервере(Номенклатура, Цена, ЕдиницаИзмерения)
	Цена = Номенклатура.ЦенаПокупки;
	ЕдиницаИзмерения = Номенклатура.ЕдиницаИзмерений; 
КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	ТекСтрока = Элементы.Услуги.ТекущиеДанные;		
	УслугиНоменклатураПриИзмененииНаСервере(ТекСтрока.Номенклатура, ТекСтрока.Цена, ТекСтрока.ЕдиницаИзмерения);
	УслугиЦенаПриИзменении(Элемент);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТоварыНоменклатураПриИзмененииНаСервере(Номенклатура, Цена, ЕдиницаИзмерения)
	Цена = Номенклатура.ЦенаПокупки;
	ЕдиницаИзмерения = Номенклатура.ЕдиницаИзмерений;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;	
	ТоварыНоменклатураПриИзмененииНаСервере(ТекСтрока.Номенклатура, ТекСтрока.Цена, ТекСтрока.ЕдиницаИзмерения);
	ТоварыЦенаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
	ТекСтрока = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
КонецПроцедуры


&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
КонецПроцедуры

