
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущийОбъект.ИспользоватьИндивидуальныеХарактеристики <> ТекущийОбъект.Ссылка.ИспользоватьИндивидуальныеХарактеристики Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Изменение признака использования индивидуальных характеристик запрещено после записи!";
		Сообщение.Поле = "ИспользоватьИндивидуальныеХарактеристики";
		Сообщение.УстановитьДанные(ТекущийОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьИндивидуальныеХарактеристикиПриИзменении(Элемент)
	Если Объект.ИспользоватьИндивидуальныеХарактеристики Тогда
		Элементы.НоменклатурнаяГруппа.Видимость = Истина;
		Элементы.ОбязательныеХарактеристики.Видимость = Истина;
	Иначе
		Элементы.НоменклатурнаяГруппа.Видимость = Ложь;
		Элементы.ОбязательныеХарактеристики.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры


