
&НаСервереБезКонтекста
Процедура ТоварыВидыЦенПриИзмененииНаСервере(ВидыЦен,Номенклатура, Цена)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныПоВидамЦенСрезПервых.Цена,
		|	ЦеныПоВидамЦенСрезПервых.Товары,
		|	ЦеныПоВидамЦенСрезПервых.ВидыЦен
		|ИЗ
		|	РегистрСведений.ЦеныПоВидамЦен.СрезПоследних КАК ЦеныПоВидамЦенСрезПервых
		|ГДЕ
		|	ЦеныПоВидамЦенСрезПервых.Товары = &Номенклатура
		|	И ЦеныПоВидамЦенСрезПервых.ВидыЦен = &ВидыЦен";
	
	Запрос.УстановитьПараметр("ВидыЦен", ВидыЦен);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() Тогда
		Цена = 0;
	Иначе
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Цена = ВыборкаДетальныеЗаписи.Цена;
		КонецЦикла;	
	КонецЕсли;
	

	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВидыЦенПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТоварыВидыЦенПриИзмененииНаСервере(ТекСтрока.ВидыЦен, ТекСтрока.Номенклатура, ТекСтрока.Цена);
	ТоварыЦенаПриИзменении(Элемент);
КонецПроцедуры



&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма");
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ТоварыНоменклатураПриИзмененииНаСервере(Номенклатура, Цена, ЕдиницаИзмерения)
	Цена = Номенклатура.ЦенаПокупки;
	ЕдиницаИзмерения = Номенклатура.ЕдиницаИзмерений;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;	
	ТоварыНоменклатураПриИзмененииНаСервере(ТекСтрока.Номенклатура, ТекСтрока.Цена, ТекСтрока.ЕдиницаИзмерения);
	ТоварыЦенаПриИзменении(Элемент);
КонецПроцедуры


&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
	ТоварыСуммаПриИзменении(Элемент);
КонецПроцедуры

