
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЧтениеИзФормы(Команда)
	// Вставить содержимое обработчика.
	ПолучениеЗначения = НаборКонстант.НаименованиеКомпании;
	ПоказатьОповещениеПользователя(ПолучениеЗначения);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЧтениеИзБазыНаСервере()
	// Вставить содержимое обработчика. 
	ДанныеИзБазы =  Константы.НаименованиеКомпании.Получить();
	Возврат(ДанныеИзБазы);
КонецФункции

&НаКлиенте
Асинх Процедура ЧтениеИзБазы(Команда)
	ПолученоеЗначение = Ждать ЧтениеИзБазыНаСервере();   
	ПоказатьОповещениеПользователя(ПолученоеЗначение);
КонецПроцедуры


